//	프로그램 명: troy
//	제한시간: 1 초

//	트로이 전쟁은 그리스 로마 신화에서 나오는 전쟁이다. 트로이 군과 그리스 군이 싸우는데,그리스군은 트로이을 멸망시키려고 하는데,그 방법을 모른다. 그래서 그리스군이 예언자 칼카스를 불러 트로이를 멸망시키는 방법에 대해 알아보았다.
//	칼카스는 트로이를 멸망시키려면 네 가지 일이 이루어져야 한다고 말했다. 그중에서 세 가지는 했는데,마지막 한 가지,트로이 성의 대들보를 부수는 것이 아직 이루어지지 않았다. 하지만 트로이 성은 태양의 신 아폴론과 바다의 신 포세이돈이 쌓은 것이라 그리스 군이 부수지 못한다.
//	그래서 그리스 군의 오디세우스 장군이 목마를 이용해 대들보를 부수는 방법을 생각해냈다. 목마를 만드는 데는 목재 1000개가 필요하다.
//	만들고 싶은 목마의 수와 목재의 수를 입력받고 만들 수 있으면 O,만들 수 없으면 X를 출력하는 프로그램을 작성하여라.
//	그러니까 목마 10개와 목재 5000개를 입력받았을 때 목마 10개를 만드려면 목재 10000개가 필요하다. 그러므로 5000개로 목마 10개를 만들지 못하니 X를 출력한다.
//	
//	입력
//	첫 번째 줄에는 목마의 개수를 입력받는다.
//	두 번째 줄에는 목재의 수를 입력받는다.
//	출력
//	목마를 만들 수 있으면 'O' 아니면 'X'를 출력한다.

//	입출력 예

//	입력
//	5
//	10000
//	출력	
//	O

//	입력	
//	5
//	2000	
//	출력
//	X

package 더블릿;

import java.util.Scanner;

public class twoseven {

	public static void main(String[] args) {
		
		Scanner sc = new Scanner(System.in);
		
		int ho = sc.nextInt();
		int tr = sc.nextInt();
		
		if(ho*1000 <= tr)
		{
			System.out.println("O");
		}
		else
		{
			System.out.println("X");
		}

	}

}
